Revit 2024 API
WallSweepInfo.IsEqual Method
 Determines if the input object is equivalent to this WallSweepInfo.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsEqual(
	WallSweepInfo toCompare
)
Visual Basic
Public Function IsEqual ( _
	toCompare As WallSweepInfo _
) As Boolean
Visual C++
public:
bool IsEqual(
	WallSweepInfo^ toCompare
)
Parameters
toCompare
Type: Autodesk.Revit.DB.WallSweepInfo
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace